; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v13 ?v1)
             (pred_7 ?v6 ?v5)
             (pred_1 ?v13 ?v5)
             (pred_12 ?v8 ?v13 )
	     (pred_10 ?v13)
             (pred_6 ?v11)
             (pred_9 ?v6)
             (pred_5 ?v5)
             (pred_3 ?v13)
             (pred_2 ?v6)
             (pred_8 ?v13)
             (pred_4 ))



(:action op_2
:parameters (?v4 ?v12 ?v10 ?v9)
:precondition (and (pred_6 ?v4) (pred_6 ?v12) (pred_9 ?v10) (pred_5 ?v9)
          (pred_11 ?v4 ?v12) (pred_7 ?v10 ?v9)
                   (pred_1 ?v12 ?v9) (pred_10 ?v4) 
                   (pred_3 ?v12) (pred_2 ?v10))
:effect (and  (pred_8 ?v12) (not (pred_3 ?v12))))


(:action op_4
:parameters (?v4 ?v2)
:precondition (and (pred_6 ?v4) (pred_6 ?v2)
               (pred_10 ?v4) (pred_11 ?v4 ?v2) (pred_8 ?v2))
:effect (and (pred_10 ?v2) (not (pred_10 ?v4))))

(:action op_1
:parameters (?v4 ?v10)
:precondition (and (pred_6 ?v4) (pred_9 ?v10) 
                  (pred_10 ?v4) (pred_12 ?v10 ?v4) (pred_4 ))
:effect (and (pred_2 ?v10)
   (not (pred_12 ?v10 ?v4)) (not (pred_4 ))))


(:action op_3
:parameters (?v4 ?v7 ?v3)
:precondition (and (pred_6 ?v4) (pred_9 ?v7) (pred_9 ?v3)
                  (pred_10 ?v4) (pred_2 ?v3) (pred_12 ?v7 ?v4))
:effect (and (pred_2 ?v7) (pred_12 ?v3 ?v4)
        (not (pred_2 ?v3)) (not (pred_12 ?v7 ?v4))))

(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_6 ?v4) (pred_9 ?v10) 
                  (pred_10 ?v4) (pred_2 ?v10))
:effect (and (pred_4 ) (pred_12 ?v10 ?v4) (not (pred_2 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_09 obj_02 obj_05 obj_11 obj_15 obj_14 obj_12 obj_23 obj_24 obj_19 obj_29 obj_25 obj_27 obj_31 obj_17 obj_03 obj_13 obj_30 obj_26 obj_28 obj_01 obj_06 obj_08 obj_21
    obj_16 obj_07 obj_18
    obj_10 obj_04 obj_20
    )

    (:init
       (pred_4)

       (pred_6 obj_22)
       (pred_6 obj_09)
       (pred_6 obj_02)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_15)
       (pred_6 obj_14)
       (pred_6 obj_12)
       (pred_6 obj_23)
       (pred_6 obj_24)
       (pred_6 obj_19)
       (pred_6 obj_29)
       (pred_6 obj_25)
       (pred_6 obj_27)
       (pred_6 obj_31)
       (pred_6 obj_17)
       (pred_6 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_30)
       (pred_6 obj_26)
       (pred_6 obj_28)
       (pred_6 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_08)
       (pred_6 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_9 obj_10)
       (pred_9 obj_04)
       (pred_9 obj_20)

       (pred_11 obj_22 obj_15)
       (pred_11 obj_22 obj_09)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_02)
       (pred_11 obj_09 obj_22)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_02 obj_09)
       (pred_11 obj_05 obj_23)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_22)
       (pred_11 obj_14 obj_29)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_12 obj_25)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_23 obj_27)
       (pred_11 obj_23 obj_24)
       (pred_11 obj_23 obj_05)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_24 obj_31)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_24 obj_23)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_29)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_29 obj_25)
       (pred_11 obj_29 obj_14)
       (pred_11 obj_29 obj_19)
       (pred_11 obj_25 obj_13)
       (pred_11 obj_25 obj_27)
       (pred_11 obj_25 obj_12)
       (pred_11 obj_25 obj_29)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_31)
       (pred_11 obj_27 obj_23)
       (pred_11 obj_27 obj_25)
       (pred_11 obj_31 obj_26)
       (pred_11 obj_31 obj_24)
       (pred_11 obj_31 obj_27)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_03 obj_13)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_13 obj_25)
       (pred_11 obj_13 obj_03)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_30 obj_26)
       (pred_11 obj_30 obj_27)
       (pred_11 obj_30 obj_13)
       (pred_11 obj_26 obj_21)
       (pred_11 obj_26 obj_31)
       (pred_11 obj_26 obj_30)
       (pred_11 obj_28 obj_01)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_01 obj_28)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_08 obj_30)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_21 obj_26)
       (pred_11 obj_21 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_28)
       (pred_3 obj_17)
       (pred_1  obj_03 obj_16)
       (pred_1  obj_28 obj_07)
       (pred_1  obj_17 obj_18)
       (pred_8 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_02)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_8 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_12)
       (pred_8 obj_23)
       (pred_8 obj_24)
       (pred_8 obj_19)
       (pred_8 obj_29)
       (pred_8 obj_25)
       (pred_8 obj_27)
       (pred_8 obj_31)
       (pred_8 obj_13)
       (pred_8 obj_30)
       (pred_8 obj_26)
       (pred_8 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_21)

       (pred_7  obj_10 obj_16)
       (pred_7  obj_04 obj_07)
       (pred_7  obj_20 obj_18)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_04 obj_27)
       (pred_12 obj_20 obj_11)
       (pred_10 obj_02)
    )

    (:goal (and
       (pred_12 obj_04 obj_08)
    ))
(:constraints
  (always (not (pred_10 obj_30)))
)
)

; plan
1. (op_4 obj_02 obj_05)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_05)
   goals met: 0 of 1
2. (op_4 obj_05 obj_23)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_23)
   goals met: 0 of 1
3. (op_4 obj_23 obj_27)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_27)
   goals met: 0 of 1
4. (op_1 obj_27 obj_04)
   deleted: (pred_12 obj_04 obj_27) (pred_4)
   added: (pred_2 obj_04)
   goals met: 0 of 1
5. (op_4 obj_27 obj_25)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_25)
   goals met: 0 of 1
6. (op_4 obj_25 obj_13)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_13)
   goals met: 0 of 1
7. (op_4 obj_13 obj_06)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_06)
   goals met: 0 of 1
8. (op_4 obj_06 obj_08)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_08)
   goals met: 0 of 1
9. (op_5 obj_08 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_4) (pred_12 obj_04 obj_08)
   goals met: 1 of 1
